Repository: chocoford/ExcalidrawZ
Catalog: ExcalidrawZ/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, nl, pl, pt, ru, th, tr, vi, zh_hans, zh_hant

# aiChatFileAccessHelpLockedFile
source: This file is locked. AI cannot read or edit it; generated changes use a proposal canvas.
ar: هذا الملف مقفل. لا يمكن للذكاء الاصطناعي قراءته أو تعديله؛ التغييرات التي تم إنشاؤها تستخدم لوحة الاقتراحات.
de: Diese Datei ist gesperrt. Die KI kann sie nicht lesen oder bearbeiten; erzeugte Änderungen verwenden eine Vorschlagsoberfläche.
es: Este archivo está bloqueado. La IA no puede leerlo ni editarlo; los cambios generados utilizan un lienzo de propuesta.
fr: Ce fichier est verrouillé. L'IA ne peut pas le lire ou le modifier ; les modifications générées utilisent un canevas de proposition.
hi: यह फ़ाइल लॉक की गई है। AI इसे पढ़ या संपादित नहीं कर सकता; उत्पन्न परिवर्तनों में एक प्रस्ताव कैनवास का उपयोग होता है।
it: Questo file è bloccato. L'AI non può leggerlo o modificarlo; le modifiche generate utilizzano una tela di proposta.
ja: このファイルはロックされています。AIはそれを読み取ったり編集したりできません; 生成された変更は提案キャンバスを使用します。
ko: 이 파일은 잠겨 있습니다. AI는 이 파일을 읽거나 수정할 수 없으며, 생성된 변경 사항은 제안 캔버스를 사용합니다.
nl: Dit bestand is vergrendeld. AI kan het niet lezen of bewerken; gegenereerde wijzigingen gebruiken een voorstelcanvas.
pl: Ten plik jest zablokowany. AI nie może go odczytywać ani edytować; generowane zmiany używają kanwy propozycji.
pt: Este arquivo está bloqueado. A IA não pode lê-lo ou editá-lo; as alterações geradas usam uma tela de proposta.
ru: Этот файл заблокирован. Искусственный интеллект не может его читать или редактировать; сгенерированные изменения используют холст предложений.
th: ไฟล์นี้ถูกล็อค AI ไม่สามารถอ่านหรือแก้ไขได้ การเปลี่ยนแปลงที่สร้างขึ้นจะใช้ผืนผ้าใบการเสนอ
tr: Bu dosya kilitli. Yapay zeka bunu okuyamaz veya düzenleyemez; oluşturulan değişiklikler öneri tuvalini kullanır.
vi: Tệp này đang bị khóa. AI không thể đọc hoặc chỉnh sửa nó; các thay đổi được tạo ra sẽ sử dụng canvas đề xuất.
zh_hans: 该文件已锁定。AI 无法读取或编辑它；生成的更改使用提案画布。
zh_hant: 此文件已鎖定。AI 無法讀取或編輯它；生成的更改使用提案畫布。

# aiChatFileAccessHelpNoActiveFile
source: No file is open. AI can answer without file access.
ar: لا يوجد ملف مفتوح. يمكن للذكاء الاصطناعي الإجابة بدون الوصول إلى الملف.
de: Es ist keine Datei geöffnet. Die KI kann ohne Dateizugriff antworten.
es: No hay ningún archivo abierto. La IA puede responder sin acceso al archivo.
fr: Aucun fichier n'est ouvert. L'IA peut répondre sans accès au fichier.
hi: कोई फ़ाइल खुली नहीं है। AI फ़ाइल पहुँच के बिना उत्तर दे सकता है।
it: Nessun file è aperto. L'AI può rispondere senza accesso al file.
ja: 開いているファイルがありません。AIはファイルアクセスなしで回答できます。
ko: 열린 파일이 없습니다. AI는 파일 접근 없이도 답변할 수 있습니다.
nl: Er is geen bestand geopend. AI kan antwoorden zonder toegang tot het bestand.
pl: Żaden plik nie jest otwarty. AI może odpowiadać bez dostępu do pliku.
pt: Nenhum arquivo está aberto. A IA pode responder sem acesso ao arquivo.
ru: Нет открытого файла. Искусственный интеллект может отвечать без доступа к файлу.
th: ไม่มีไฟล์ที่เปิดอยู่ AI สามารถตอบได้โดยไม่ต้องเข้าถึงไฟล์
tr: Açık bir dosya yok. Yapay zeka dosya erişimi olmadan yanıt verebilir.
vi: Không có tệp nào đang mở. AI có thể trả lời mà không cần truy cập tệp.
zh_hans: 没有打开的文件。AI 可以在没有文件访问的情况下回答。
zh_hant: 沒有打開的文件。AI 可以在沒有文件訪問的情況下回答。

# aiChatInputAttachmentMenuButtonAdd
source: Add
ar: إضافة
de: Hinzufügen
es: Agregar
fr: Ajouter
hi: जोड़ें
it: Aggiungi
ja: 追加
ko: 추가
nl: Toevoegen
pl: Dodaj
pt: Adicionar
ru: Добавить
th: เพิ่ม
tr: Ekle
vi: Thêm
zh_hans: 添加
zh_hant: 添加

# aiChatInputAttachmentMenuItemCamera
source: Camera
ar: كاميرا
de: Kamera
es: Cámara
fr: Caméra
hi: कैमरा
it: Fotocamera
ja: カメラ
ko: 카메라
pl: Kamera
pt: Câmera
ru: Камера
th: กล้อง
tr: Kamera
vi: Máy ảnh
zh_hans: 相机
zh_hant: 相機

# aiChatInputAttachmentMenuItemImage
source: Image
ar: صورة
de: Bild
es: Imagen
hi: छवि
it: Immagine
ja: 画像
ko: 이미지
nl: Afbeelding
pl: Obraz
pt: Imagem
ru: Изображение
th: รูปภาพ
tr: Görüntü
vi: Hình ảnh
zh_hans: 图片
zh_hant: 圖片

# aiChatInputAttachmentMenuItemPhotoLibrary
source: Photo Library
ar: مكتبة الصور
de: Fotos
es: Galería de Fotos
fr: Bibliothèque de photos
hi: फोटो पुस्तकालय
it: Galleria Fotografica
ja: フォトライブラリ
ko: 사진 라이브러리
nl: Fotobibliotheek
pl: Biblioteka Zdjęć
pt: Biblioteca de Fotos
ru: Фотогалерея
th: คลังรูปภาพ
tr: Fotoğraf Kütüphanesi
vi: Thư viện ảnh
zh_hans: 照片库
zh_hant: 照片庫

# aiChatInputPlaceholder
source: Ask AI to draw...
ar: اطلب من الذكاء الاصطناعي رسم...
de: Fragen Sie die KI, um eine Zeichnung zu erstellen...
es: Pídele a la IA que describa el contenido a dibujar...
fr: Demandez à l'IA de dessiner...
hi: AI से चित्र बनाने के लिए कहें...
it: Chiedi all'IA di disegnare...
ja: AIに描画を依頼する...
ko: AI에게 그리도록 요청하세요...
nl: Vraag AI om te tekenen...
pl: Poproś AI, aby narysowało...
pt: Peça à IA para desenhar...
ru: Попросите ИИ нарисовать...
th: ถาม AI ให้วาด...
tr: AI'den çizmesini isteyin...
vi: Hỏi AI để vẽ...
zh_hans: 向AI描述绘制内容...
zh_hant: 向AI描述繪製內容

# aiChatLoadingMoreText
source: Loading earlier items...
ar: جارٍ تحميل العناصر الأقدم...
de: Frühere Elemente laden...
es: Cargando elementos anteriores...
fr: Chargement des éléments précédents...
hi: पिछले आइटम लोड हो रहे हैं...
it: Caricamento dei messaggi precedenti...
ja: 以前のアイテムを読み込んでいます...
ko: 이전 항목 불러오는 중...
nl: Vervroeg eerdere items laden...
pl: Ładowanie wcześniejszych elementów...
pt: Carregando itens anteriores...
ru: Загрузка более ранних элементов...
th: กำลังโหลดรายการก่อนหน้า...
tr: Önceki öğeler yükleniyor...
vi: Đang tải các mục trước đó...
zh_hans: 加载早期项目...
zh_hant: 正在加載更早的項目...

# aiChatLoadMoreText
source: Scroll up to load %d earlier items
ar: قم بالتمرير لأعلى لتحميل %d عنصرًا أقدم
de: Nach oben scrollen, um %d frühere Elemente zu laden
es: Desplázate hacia arriba para cargar %d elementos anteriores
fr: Faites défiler vers le haut pour charger %d éléments précédents
hi: पहले के %d आइटम लोड करने के लिए ऊपर स्क्रॉल करें
it: Scorri verso l'alto per caricare %d messaggi precedenti
ja: %d 以前のアイテムを読み込むには、上にスクロールしてください
ko: 위로 스크롤하여 %d개의 이전 항목 불러오기
nl: Scroll omhoog om %d eerdere items te laden
pl: Przewiń w górę, aby załadować %d wcześniejszych elementów
pt: Role para cima para carregar %d itens anteriores
ru: Прокрутите вверх, чтобы загрузить %d более ранних элементов
th: เลื่อนขึ้นเพื่อโหลดรายการก่อนหน้า %d รายการ
tr: Daha önceki %d öğeleri yüklemek için yukarı kaydırın
vi: Cuộn lên để tải %d mục trước đó
zh_hans: 向上滚动以加载 %d 个早期项目
zh_hant: 向上滾動以加載 %d 個更早的項目

# aiChatLowCreditsBannerLabel
source: Only %@ credits left — tap to top up
ar: تبقى لديك فقط %@ من الائتمانات — انقر لتعبئة رصيدك
de: Nur %@ Credits übrig – tippe, um aufzuladen
es: Sólo quedan %@ créditos — toca para recargar
fr: Il ne reste que %@ crédits — appuyez pour recharger
hi: केवल %@ क्रेडिट बाकी हैं - टॉप अप करने के लिए टैप करें
it: Solo %@ crediti rimasti — tocca per ricaricare
ja: 残り %@ クレジット — タップして追加してください
ko: 잔여 %@ 크레딧 — 탭하여 충전하기
nl: Nog slechts %@ credits — tik om op te waarderen
pl: Pozostało tylko %@ kredytów — stuknij, aby doładować
pt: Apenas %@ créditos restantes — toque para adicionar
ru: Осталось только %@ кредитов — нажмите, чтобы пополнить
th: มีเครดิตเหลือเพียง %@ — แตะเพื่อเติมเงิน
tr: Yalnızca %@ kredi kaldı — yüklemek için dokunun
vi: Chỉ còn %@ tín dụng — chạm để nạp thêm
zh_hans: 仅剩 %@ 点积分 — 点击充值
zh_hant: 僅剩 %@ 顆積分 — 點擊以充值

# aiChatModelTierExtraHigh
source: Extra High
ar: عالي جدًا
de: Extra Hoch
es: Extra Alto
fr: Très élevé
hi: बहुत उच्च
it: Extra Alto
ja: 特に高い
ko: 매우 높음
nl: Extra Hoog
pl: Bardzo wysoki
pt: Extra Alto
ru: Экстра Высокий
th: สูงพิเศษ
tr: Ekstra Yüksek
vi: Cực cao
zh_hans: 超高
zh_hant: 特高

# aiChatModelTierHigh
source: High
ar: عالي
de: Hoch
es: Alto
fr: Élevé
hi: उच्च
it: Alto
ja: 高い
ko: 높음
nl: Hoog
pl: Wysoki
pt: Alto
ru: Высокий
th: สูง
tr: Yüksek
vi: Cao
zh_hans: 高
zh_hant: 高

# aiChatModelTierLow
source: Low
ar: منخفض
de: Niedrig
es: Bajo
fr: Bas
hi: कम
it: Basso
ja: 低い
ko: 낮음
nl: Laag
pl: Niski
pt: Baixo
ru: Низкий
th: ต่ำ
tr: Düşük
vi: Thấp
zh_hans: 低
zh_hant: 低

# aiChatModelTierMedium
source: Medium
ar: متوسط
de: Mittel
es: Medio
fr: Moyen
hi: मध्यम
it: Medio
ja: 中程度
ko: 보통
nl: Gemiddeld
pl: Średni
pt: Médio
ru: Средний
th: กลาง
tr: Orta
vi: Trung bình
zh_hans: 中
zh_hant: 中

# aiChatPendingQueueButtonRemove
source: Remove from queue
ar: إزالة من الصف
de: Aus der Warteschlange entfernen
es: Eliminar de la cola
fr: Retirer de la file d'attente
hi: क्यू से हटाएं
it: Rimuovi dalla coda
ja: キューから削除
ko: 대기열에서 제거
nl: Verwijderen uit wachtrij
pl: Usuń z kolejki
pt: Remover da fila
ru: Удалить из очереди
th: เอาออกจากคิว
tr: Kuyruktan kaldır
vi: Xóa khỏi danh sách chờ
zh_hans: 从队列中移除
zh_hant: 從隊列中移除

# aiChatRevertConfirmationDialogButtonConfirm
source: Revert and Edit
ar: استرجاع وتعديل
de: Zurücksetzen und bearbeiten
es: Revertir y editar
fr: Revenir en arrière et modifier
hi: पूर्ववत करें और संपादित करें
it: Ripristina e Modifica
ja: 元に戻して編集
ko: 복원하고 편집
nl: Herstel en Bewerk
pl: Przywróć i edytuj
pt: Reverter e Editar
ru: Вернуть и редактировать
th: ย้อนกลับและแก้ไข
tr: Geri al ve düzenle
vi: Khôi phục và Chỉnh sửa
zh_hans: 恢复并编辑
zh_hant: 恢復並編輯

# aiChatRevertConfirmationDialogMessage
source: This will immediately restore the canvas to the checkpoint before this message, discard later chat messages, and refill the input with this prompt.
ar: سيتم استعادة اللوحة على الفور إلى النقطة المرجعية قبل هذه الرسالة، وتجاهل الرسائل اللاحقة، وإعادة ملء المدخل بهذا الطلب.
de: Dadurch wird die Leinwand sofort auf den Punkt vor dieser Nachricht zurückgesetzt, spätere Chat-Nachrichten werden verworfen und der Eingabetext wird mit diesem Prompt aufgefüllt.
es: Esto restaurará inmediatamente el lienzo al punto de control antes de este mensaje, descartará mensajes de chat posteriores y rellenará la entrada con este aviso.
fr: Cela restaurera immédiatement le canevas à l'instant précédent ce message, supprimera les messages de chat ultérieurs et remplira à nouveau l'entrée avec cette invite.
hi: यह तुरंत कैनवास को इस संदेश से पहले के चेकपॉइंट पर पुनर्स्थापित करेगा, बाद के चैट संदेशों को हटा देगा, और इस प्रॉम्प्ट के साथ इनपुट को फिर से भर देगा।
it: Questo ripristinerà immediatamente la tela al punto di controllo precedente a questo messaggio, scartando i messaggi di chat successivi e riempiendo l'input con questo messaggio.
ja: この操作により、キャンバスがこのメッセージの前のチェックポイントに即座に復元され、後のチャットメッセージが破棄され、入力がこのプロンプトで再充填されます。
ko: 이 작업은 즉시 캔버스를 이 메시지 이전의 체크포인트로 복원하고, 이후의 채팅 메시지를 삭제하며, 이 프롬프트로 입력을 다시 채웁니다.
nl: Dit herstelt het canvas onmiddellijk naar het controlepunt vóór dit bericht, verwerpt latere chatberichten en vult de invoer opnieuw met deze prompt.
pl: To natychmiast przywróci płótno do punktu kontrolnego sprzed tej wiadomości, odrzucając późniejsze wiadomości czatu i napełniając pole wejściowe tym zapytaniem.
pt: Isso restaurará imediatamente a tela para o ponto de verificação antes desta mensagem, descartará as mensagens de chat posteriores e preencherá a entrada com este prompt.
ru: Это немедленно восстановит холст до контрольной точки перед этим сообщением,Discard later chat messages, и заполнит ввод этой подсказкой.
th: สิ่งนี้จะคืนค่าผืนผ้าให้กลับไปยังจุดตรวจสอบก่อนข้อความนี้ เสียข้อความสนทนาที่เกิดขึ้นหลังจากนั้น และเติมข้อมูลในฟอร์มด้วยข้อความนี้อีกครั้ง
tr: Bu, kanvası bu mesajdan önceki duruma hemen geri yükleyecek, sonraki sohbet mesajlarını atacak ve girişi bu istemle dolduracak.
vi: Điều này sẽ ngay lập tức khôi phục canvas về điểm kiểm tra trước tin nhắn này, loại bỏ các tin nhắn trò chuyện sau và làm đầy lại đầu vào với lời nhắc này.
zh_hans: 这将立即将画布恢复到此消息之前的检查点，丢弃后续聊天消息，并用此提示填充输入。
zh_hant: 這將立即將畫布恢復到此消息之前的檢查點，丟棄後續聊天消息，並用此提示重新填充輸入。

# aiChatRevertConfirmationDialogTitle
source: Revert and edit this message?
ar: هل تريد استرجاع وتعديل هذه الرسالة؟
de: Diese Nachricht zurücksetzen und bearbeiten?
es: ¿Revertir y editar este mensaje?
fr: Revenir et modifier ce message ?
hi: क्या इस संदेश को पूर्ववत करें और संपादित करें?
it: Ripristinare e modificare questo messaggio?
ja: このメッセージを元に戻して編集しますか？
ko: 이 메시지를 복원하고 편집하시겠습니까?
nl: Dit bericht herstellen en bewerken?
pl: Przywrócić i edytować tę wiadomość?
pt: Reverter e editar esta mensagem?
ru: Вернуть и отредактировать это сообщение?
th: ย้อนกลับและแก้ไขข้อความนี้หรือไม่?
tr: Bu mesajı geri alıp düzenlemek ister misiniz?
vi: Khôi phục và chỉnh sửa tin nhắn này?
zh_hans: 恢复并编辑此消息？
zh_hant: 恢復並編輯此消息？

# aiChatThinking
source: Thinking…
ar: تفكير...
de: Denken...
es: Pensando...
fr: En train de réfléchir...
hi: सोच रहा हूँ…
it: Pensando…
ja: 考え中…
ko: 생각 중…
nl: Denken…
pl: Myślę…
pt: Pensando…
ru: Думаю...
th: กำลังคิด...
tr: Düşünüyor...
vi: Đang suy nghĩ...
zh_hans: 思考中…
zh_hant: 思考中…

# aiChatTitle
source: AI Chat
ar: دردشة الذكاء الاصطناعي
de: KI-Chat
es: Chat IA
fr: Chat IA
hi: एआई चैट
it: Chat AI
ja: AIチャット
ko: AI 채팅
pl: Czat AI
pt: Chat de IA
ru: AI Чат
th: การสนทนา AI
tr: AI Sohbet
vi: Trò chuyện AI
zh_hans: AI 聊天
zh_hant: AI 聊天

# aiChatToolAdjustElementName
source: Adjust Canvas
ar: ضبط اللوحة
de: Leinwand anpassen
es: Ajustar Lienzo
fr: Ajuster le canevas
hi: कैनवास समायोजित करें
it: Regola Cancello
ja: キャンバス調整
ko: 캔버스 조정
nl: Pas Canvas aan
pl: Dostosuj płótno
pt: Ajustar Tela
ru: Настроить холст
th: ปรับขนาดผ้าใบ
tr: Tuvali Ayarla
vi: Điều chỉnh Canvas
zh_hans: 调整画布
zh_hant: 調整畫布

# aiChatToolCalculatorName
source: Calculator
ar: الآلة الحاسبة
de: Rechner
es: Calculadora
fr: Calculatrice
hi: कैलकुलेटर
it: Calcolatrice
ja: 計算機
ko: 계산기
nl: Rekenmachine
pl: Kalkulator
pt: Calculadora
ru: Калькулятор
th: เครื่องคิดเลข
tr: Hesap Makinesi
vi: Máy tính
zh_hans: 计算器
zh_hant: 計算器

# aiChatToolCallDeniedTitle
source: Denied
ar: مرفوض
de: Verweigert
es: Denegado
fr: Refusé
hi: अस्वीकृत
it: Negato
ja: 拒否されました
ko: 거부됨
nl: Geweigerd
pl: Odmowa
pt: Negado
ru: Запрещено
th: ปฏิเสธ
tr: Reddedildi
vi: Bị từ chối
zh_hans: 拒绝
zh_hant: 拒絕

# aiChatToolCallDisplay
source: Using %@…
ar: يتم استخدام %@…
de: Verwendung von %@...
es: Usando %@...
fr: Utilisation de %@…
hi: उपयोग कर रहा है %@…
it: Utilizzando %@…
ja: %@ を使用中…
ko: %@ 사용 중…
nl: Gebruik %@…
pl: Używam %@…
pt: Usando %@…
ru: Используя %@…
th: กำลังใช้ %@…
tr: Şu anda %@ kullanılıyor...
vi: Đang sử dụng %@…
zh_hans: 使用 %@…
zh_hant: 使用 %@…

# aiChatToolCallObservationTitle
source: Observe result
ar: راقب النتيجة
de: Ergebnis beobachten
es: Observar resultado
fr: Observer le résultat
hi: परिणाम देखें
it: Osserva il risultato
ja: 結果を観察
ko: 결과 관찰
nl: Observe resultaat
pl: Obserwuj wynik
pt: Observe o resultado
ru: Наблюдать результат
th: สังเกตผลลัพธ์
tr: Sonucu gözlemle
vi: Quan sát kết quả
zh_hans: 观察结果
zh_hant: 觀察結果

# aiChatToolDateTimeName
source: Date & Time
ar: التاريخ والوقت
de: Datum & Uhrzeit
es: Fecha y Hora
fr: Date et Heure
hi: तारीख और समय
it: Data e Ora
ja: 日付と時刻
ko: 날짜 및 시간
nl: Datum en Tijd
pl: Data i czas
pt: Data e Hora
ru: Дата и время
th: วันที่และเวลา
tr: Tarih ve Saat
vi: Ngày & Giờ
zh_hans: 日期和时间
zh_hant: 日期和時間

# aiChatToolFileAccessStatusName
source: File Access Status
ar: حالة وصول الملف
de: Dateizugriffsstatus
es: Estado de Acceso al Archivo
fr: Statut de l'accès au fichier
hi: फ़ाइल पहुँच स्थिति
it: Stato di Accesso al File
ja: ファイルアクセスステータス
ko: 파일 접근 상태
nl: Bestandstoegangsstatus
pl: Status dostępu do pliku
pt: Status de Acesso ao Arquivo
ru: Статус доступа к файлу
th: สถานะการเข้าถึงไฟล์
tr: Dosya Erişim Durumu
vi: Trạng thái truy cập tệp
zh_hans: 文件访问状态
zh_hant: 文件訪問狀態

# aiChatToolFinalAnswerName
source: Final Answer
ar: الإجابة النهائية
de: Endgültige Antwort
es: Respuesta Final
fr: Réponse finale
hi: अंतिम उत्तर
it: Risposta Finale
ja: 最終回答
ko: 최종 답변
nl: Finale Antwoord
pl: Ostateczna odpowiedź
pt: Resposta Final
ru: Окончательный ответ
th: คำตอบสุดท้าย
tr: Son Cevap
vi: Câu trả lời cuối cùng
zh_hans: 最终答案
zh_hant: 最終答案

# aiChatToolInsertLibraryItemName
source: Insert Library Item
ar: إدراج عنصر مكتبة
de: Bibliothekselement einfügen
es: Insertar Elemento de Biblioteca
fr: Insérer un élément de bibliothèque
hi: लाइब्रेरी आइटम डालें
it: Inserisci Elemento della Libreria
ja: ライブラリ項目を挿入
ko: 라이브러리 항목 삽입
nl: Voeg Bibliotheekitem Toe
pl: Wstaw element biblioteki
pt: Inserir Item da Biblioteca
ru: Вставить элемент библиотеки
th: แทรกรายการในไลบรารี
tr: Kütüphane Öğesi Ekle
vi: Chèn mục thư viện
zh_hans: 插入库项目
zh_hant: 插入庫項目

# aiChatToolListAllFilesName
source: List Files
ar: قائمة الملفات
de: Dateien auflisten
es: Listar Archivos
fr: Lister les fichiers
hi: फाइलें सूचीबद्ध करें
it: Elenca File
ja: ファイルを一覧表示
ko: 파일 목록
nl: Lijst Bestanden
pl: Lista plików
pt: Listar Arquivos
ru: Список файлов
th: รายการไฟล์
tr: Dosyaları Listele
vi: Danh sách tập tin
zh_hans: 列出文件
zh_hant: 列出文件

# aiChatToolListLibrariesName
source: List Libraries
ar: قائمة المكتبات
de: Bibliotheken auflisten
es: Listar Bibliotecas
fr: Lister les bibliothèques
hi: लाइब्रेरी सूचीबद्ध करें
it: Elenca Librerie
ja: ライブラリを一覧表示
ko: 라이브러리 목록
nl: Lijst Bibliotheken
pl: Lista bibliotek
pt: Listar Bibliotecas
ru: Список библиотек
th: รายการไลบรารี
tr: Kütüphaneleri Listele
vi: Danh sách thư viện
zh_hans: 列出库
zh_hant: 列出庫

# aiChatToolListLibraryItemsName
source: List Library Items
ar: قائمة عناصر المكتبة
de: Bibliothekselemente auflisten
es: Listar Elementos de Biblioteca
fr: Lister les éléments de bibliothèque
hi: लाइब्रेरी आइटम सूचीबद्ध करें
it: Elenca Elementi della Libreria
ja: ライブラリ項目を一覧表示
ko: 라이브러리 항목 목록
nl: Lijst Bibliotheekitems
pl: Lista elementów biblioteki
pt: Listar Itens da Biblioteca
ru: Список элементов библиотеки
th: รายการสิ่งของในไลบรารี
tr: Kütüphane Öğelerini Listele
vi: Danh sách mục thư viện
zh_hans: 列出库项目
zh_hant: 列出庫項目

# aiChatToolMathName
source: Math
ar: رياضيات
de: Mathematik
es: Matemáticas
hi: गणित
it: Matematica
ja: 数学
ko: 수학
nl: Wiskunde
pl: Matematyka
pt: Matemática
ru: Математика
th: คณิตศาสตร์
tr: Matematik
vi: Toán
zh_hans: 数学
zh_hant: 數學

# aiChatToolNavigateCanvasName
source: Navigate Canvas
ar: التنقل في اللوحة
de: Leinwand navigieren
es: Navegar en el Lienzo
fr: Naviguer dans le canevas
hi: कैनवास पर नेविगेट करें
it: Naviga nella Tela
ja: キャンバスを移動
ko: 캔버스 탐색
nl: Navigeer door Canvas
pl: Nawiguj po płótnie
pt: Navegar na Tela
ru: Навигация по холсту
th: นำทางผ้าใบ
tr: Tuvali Gez
vi: Điều hướng Canvas
zh_hans: 导航画布
zh_hant: 瀏覽畫布

# aiChatToolGetCurrentFileName
source: Get Current File
ar: احصل على الملف الحالي
de: Aktuelle Datei abrufen
es: Obtener archivo actual
fr: Obtenir le fichier actuel
hi: वर्तमान फ़ाइल प्राप्त करें
it: Ottieni file corrente
ja: 現在のファイルを取得
ko: 현재 파일 가져오기
nl: Huidig Bestand Krijgen
pl: Pobierz bieżący plik
pt: Obter Arquivo Atual
ru: Получить текущий файл
th: รับชื่อไฟล์ปัจจุบัน
tr: Geçerli Dosyayı Al
vi: Lấy Tệp Hiện Tại
zh_hans: 获取当前文件
zh_hant: 獲取當前檔案

# aiChatToolListGroupsName
source: List Groups
ar: قائمة المجموعات
de: Gruppen auflisten
es: Listar grupos
fr: Lister les groupes
hi: समूहों की सूची
it: Elenca gruppi
ja: グループ一覧
ko: 그룹 목록
nl: Groepen Lijsten
pl: Lista grup
pt: Listar Grupos
ru: Список групп
th: รายการกลุ่ม
tr: Grupları Listele
vi: Danh Sách Nhóm
zh_hans: 列出组
zh_hant: 列出群組

# aiChatToolListLocalFilesName
source: List Local Files
ar: قائمة الملفات المحلية
de: Lokale Dateien auflisten
es: Listar archivos locales
fr: Lister les fichiers locaux
hi: स्थानीय फ़ाइलों की सूची
it: Elenca file locali
ja: ローカルファイル一覧
ko: 로컬 파일 목록
nl: Lokal Bestanden Lijsten
pl: Lista lokalnych plików
pt: Listar Arquivos Locais
ru: Список локальных файлов
th: รายการไฟล์ในเครื่อง
tr: Yerel Dosyaları Listele
vi: Danh Sách Tệp Cục Bộ
zh_hans: 列出本地文件
zh_hant: 列出本地檔案

# aiChatToolListLocalFoldersName
source: List Local Folders
ar: قائمة المجلدات المحلية
de: Lokale Ordner auflisten
es: Listar carpetas locales
fr: Lister les dossiers locaux
hi: स्थानीय फ़ोल्डरों की सूची
it: Elenca cartelle locali
ja: ローカルフォルダ一覧
ko: 로컬 폴더 목록
nl: Lokale Mappen Lijsten
pl: Lista lokalnych folderów
pt: Listar Pastas Locais
ru: Список локальных папок
th: รายการโฟลเดอร์ในเครื่อง
tr: Yerel Klasörleri Listele
vi: Danh Sách Thư Mục Cục Bộ
zh_hans: 列出本地文件夹
zh_hant: 列出本地資料夾

# aiChatToolSetCanvasPreferencesName
source: Set Canvas Preferences
ar: إعداد تفضيلات القماش
de: Leinwand-Einstellungen festlegen
es: Establecer preferencias del lienzo
fr: Définir les préférences du canevas
hi: कैनवास प्राथमिकताएँ सेट करें
it: Imposta preferenze tela
ja: キャンバスの設定
ko: 캔버스 환경 설정
nl: Canvas Voorkeuren Instellen
pl: Ustawienia preferencji płótna
pt: Definir Preferências do Canvas
ru: Настройки холста
th: ตั้งค่าชอบแคนวาส
tr: Tuval Tercihlerini Ayarla
vi: Cài Đặt Tùy Chọn Canvas
zh_hans: 设置画布偏好设置
zh_hant: 設置畫布偏好

# aiChatToolQueryFileHistoryName
source: List File History
ar: قائمة تاريخ الملفات
de: Dateihistorie auflisten
es: Listar Historial de Archivos
fr: Lister l'historique des fichiers
hi: फाइल इतिहास सूचीबद्ध करें
it: Elenca Storia dei File
ja: ファイル履歴を一覧表示
ko: 파일 이력 목록
nl: Lijst Bestandsgeschiedenis
pl: Lista historii plików
pt: Listar Histórico de Arquivos
ru: Список истории файлов
th: ประวัติไฟล์
tr: Dosya Geçmişini Listele
vi: Danh sách lịch sử tập tin
zh_hans: 列出文件历史
zh_hant: 查詢文件歷史

# aiChatToolQueryLibraryItemName
source: Query Library Item
ar: استعلام عن عنصر المكتبة
de: Bibliothekselement abfragen
es: Consultar Elemento de Biblioteca
fr: Interroger l'élément de bibliothèque
hi: लाइब्रेरी आइटम क्वेरी करें
it: Interroga Elemento della Libreria
ja: ライブラリ項目を照会
ko: 라이브러리 항목 조회
nl: Vraag Bibliotheekitem
pl: Zapytaj o element biblioteki
pt: Consultar Item da Biblioteca
ru: Запрос элемента библиотеки
th: ค้นหารายการในไลบรารี
tr: Kütüphane Öğesini Sorgula
vi: Truy vấn mục thư viện
zh_hans: 查询库项目
zh_hant: 查詢庫項目

# aiChatToolReadCanvasImageName
source: Read Canvas Image
ar: قراءة صورة اللوحة
de: Leinwandbild lesen
es: Leer Imagen del Lienzo
fr: Lire l'image du canevas
hi: कैनवास छवि पढ़ें
it: Leggi Immagine della Tela
ja: キャンバス画像を読み込む
ko: 캔버스 이미지 읽기
nl: Lees Canvasafbeelding
pl: Odczytaj obraz z płótna
pt: Ler Imagem da Tela
ru: Читать изображение холста
th: อ่านภาพจากผ้าใบ
tr: Tuval Resmini Oku
vi: Đọc hình ảnh Canvas
zh_hans: 读取画布图像
zh_hant: 讀取畫布圖像

# aiChatToolReadFileName
source: Read Canvas File
ar: قراءة ملف اللوحة
de: Leinwanddatei lesen
es: Leer Archivo del Lienzo
fr: Lire le fichier du canevas
hi: कैनवास फ़ाइल पढ़ें
it: Leggi File della Tela
ja: キャンバスファイルを読み込む
ko: 캔버스 파일 읽기
nl: Lees Canvasbestand
pl: Odczytaj plik z płótna
pt: Ler Arquivo da Tela
ru: Читать файл холста
th: อ่านไฟล์จากผ้าใบ
tr: Dosyayı Oku
vi: Đọc tập tin Canvas
zh_hans: 读取画布文件
zh_hant: 讀取畫布文件

# aiChatToolRenameFileName
source: Rename File
ar: إعادة تسمية الملف
de: Datei umbenennen
es: Renombrar Archivo
fr: Renommer le fichier
hi: फाइल का नाम बदलें
it: Rinomina File
ja: ファイル名を変更
ko: 파일 이름 바꾸기
nl: Hernoem Bestand
pl: Zmień nazwę pliku
pt: Renomear Arquivo
ru: Переименовать файл
th: เปลี่ยนชื่อไฟล์
tr: Dosyayı Yeniden Adlandır
vi: Đổi tên tập tin
zh_hans: 重命名文件
zh_hant: 重命名文件

# aiChatToolRestoreFileHistoryName
source: Restore File
ar: استعادة الملف
de: Datei wiederherstellen
es: Restaurar archivo
fr: Restaurer le fichier
hi: फाइल पुनर्स्थापित करें
it: Ripristina file
ja: ファイルを復元
ko: 파일 복원
nl: Herstel Bestand
pl: Przywróć Plik
pt: Restaurar Arquivo
ru: Восстановить файл
th: กู้คืนไฟล์
tr: Dosyayı Geri Yükle
vi: Khôi phục Tệp
zh_hans: 恢复文件
zh_hant: 恢復檔案

# aiChatToolWebFetchName
source: Fetch URL
ar: جلب الرابط
de: URL abrufen
es: Obtener URL
fr: Récupérer l'URL
hi: URL लाएं
it: Recupera URL
ja: URLを取得
ko: URL 가져오기
nl: Haal URL op
pl: Pobierz URL
pt: Buscar URL
ru: Загрузить URL
th: ดึง URL
tr: URL'yi Getir
vi: Lấy URL
zh_hans: 获取网址
zh_hant: 擷取網址

# aiChatToolWebSearchName
source: Web Search
ar: بحث ويب
de: Websuche
es: Búsqueda en la Web
fr: Recherche sur le Web
hi: वेब खोज
it: Ricerca Web
ja: ウェブ検索
ko: 웹 검색
nl: Webzoektocht
pl: Wyszukiwanie w sieci
pt: Pesquisa na Web
ru: Поиск в интернете
th: ค้นหาทางเว็บ
tr: Web Arama
vi: Tìm kiếm trên web
zh_hans: 网页搜索
zh_hant: 網頁搜索
